#dict字典和set
#list没有对应关系，而dict可以构建key-value关系
#查找对应关系需要在list找位置，再去另一个list找位置，表一长，查找就困难
#相反，dict创建时就搭建好了对应关系，不会因为表变大就拖慢速度

#除了初始化指定，也可以中途加入
d={'a':1,'b':2,'c':3}
print(d['a'])

d['d']=4
print(d)

#一一对应，所以后续再写入会更改，key不存在会报错
#除非用.get()方法，key不存在时可以返回直接指定的值，或者直接None

#比起list，查询快，但内存大，空间换时间，记住key不可变
#哈希算法需要保证正确性

#set是key的集合，不存value，key不可重复
s = {1,2,3,4}
print(s)

#或者：
#s = set([1,2,3])
#把list变成set

#重复元素自动被过滤

s = {1,1,2,3,4,2,3,4}
print(s)
#只输出{1，2，3，4}，但内部元素并没有变
s.remove(4)
#删除元素
print(s)
#set可以看成数学意义上的无序和无重复元素的集合，因此，两个set可以做数学意义上的交集、并集等操作：

s1={1,3,4}
s2={2,3,1}
print(s1 & s2)

print(s1 | s2)

#set和dict的唯一区别仅在于没有存储对应的value，但是，set的原理和dict一样，所以，同样不可以放入可变对象，因为无法判断两个可变对象是否相等，也就无法保证set内部“不会有重复元素”
#str是不变对象，而list是可变对象。
#对于不变对象来说，调用对象自身的任意方法，也不会改变该对象自身的内容。相反，这些方法会创建新的对象并返回，这样，就保证了不可变对象本身永远是不可变的。

# 需要存储一组数据？
#   需要键值对映射？ → 字典 (dict)
#   只需要存储元素？
#     元素需要唯一？ → 集合 (set)
#     元素可重复？
#       需要修改（增/删/改）？ → 列表 (list)
#       不需要修改（只读保护）？ → 元组 (tuple)