# 知识前览：
# 字典：用key来查值value
# d = {"name":"张三","age":20,"score":95}
# 内含一对对，对应的key与value，之间：分隔，而不同对用，

# 增删改查：
# d["name"]
# 结果是张三，也就是通过key做查找对应的value
# d.get("name")
# 效果如上，多一层若key不存在不报错，而是返回None

# d["age"]=21
# 直接赋值覆盖

# d["city"]=广东
# 新key直接赋值

# del d["score"]
# 删除键，结果是该对被删除
# key是核心
# d.pop("score")
# 删除并且会返回被删的值

# key不可变！
# 可以是字符串数字元组，唯独不能是列表
# 因为list可变

# key必须唯一！

#字典查key，list查位置（0开始）

#首先明确需求是统计字符频率，那就要先把每个字符取出来看
#第二步就是统计，用一个计数器去累加，如果出现就+1

B7='helloworld'

# count = 0
# for B7c in B7:
#     if B7c == "?":
#         count +=1 #计数器+1
# print(count)

#python的字符串自带.count()方法不用循环可以直接数

# print(B7.count("?"))

#但是不管如何这样做只能统计？单个字符的出现次数
#于是需要引出字典

d={}
for B7c in B7:
    d[B7c] = d.get(B7c,0) +1

#d.get()是查询了key得出值，相当于我取一个值出来了，而且不会报错
#括号内（key,自定默认值)如果key不存在就先返回自定默认值
#d.get(B7c,0)+1

# 先查B7c，如果发现在字典里，就返回出现的次数也就是值
# 否则就先返回自定值也就是0，出现0次
# 不管返回什么，+1计数，这样一来就可以进行统计
# 写法扩展出来如下：

# if B7c in d:
#     d[B7c]+=1
# else:
#     d[B7c] =1
#效果为，遍历，得到某个字符，如果字典查询到key，值+1
#否则，key不存在时，d[]可以直接增加赋值，并且+1
print(d)