#写一个函数 greet(name="世界")，输出 你好，世界；不带参数和带参数各调一次

def greet(name = "世界"):
    
    s= (f"你好,{name}")
    return s

s=greet(name = "世界")
print(s)

s =input("你的名字是？")

print(greet(s))

#默认参数，注意有默认参数的值在定义时应该放在后面
#默认参数要指向不变对象
#定义参数时不知道参数有多少，默认作为列表和元组传入去设计函数
#但是调用函数的时候，要传入多个参数需要先自己组装，多这一步手动
#运用可变参数*，直接写入参数调用就行，会自动完成这一步，包装一个tuple
# nums = [3, 1, 4, 1, 5]
# print(*nums)         # 等价于 print(3, 1, 4, 1, 5) → 输出 3 1 4 1 5
# mx = max(*nums)      # 等价于 max(3, 1, 4, 1, 5) → 5
#如果不做可变参数这一步，那函数拿到的就是一个参数，这个参数是一个装着list的值而不是列表里具体的那些元素

#关键词参数是同样的作用，只不过把可变参数是tuple，它是字典dist
#不是"我想让它装成 dict 就写 **"，而是"传进来的实参长什么样，决定了它被打包成什么"​。
#只有列表里没声明、调用时又以 xx=yy 形式传进来的，才被 **kw 收走。

#但是因为来者不拒，所以有了命名关键词参数
#命名关键字参数，可以理解成给 **kw 这个"来者不拒"的机制加一道闸门——规定函数只能收哪几个名字的关键字参数，别的都不许进。
#用*来分隔，前面是参数，后面是命名关键字参数，符合后面的key的，才能传进来
#如果参数列表已经有可变参数，那么这个可变参数可以同时充当*的作用
#规则和普通默认参数一致：有默认值的可省略，没默认值的必须传

#参数定义顺序：必选参数、默认参数、可变参数、命名关键字参数和关键字参数。